dict_tickets={
    'G1234':['北京','天津','18:06','18:33','00:27'],
    'G2345':['上海','武汉','08:06','12:39','04:32'],
    'G2035': ['北京', '武汉', '08:06', '12:39', '04:32'],
    'G2333': ['上海', '杭州', '08:06', '12:39', '04:32']
}
print('车次','出发站','到达站','触发时间','到达时间','时长')

for k,v in dict_tickets.items():
    print(k,v[0],v[1],v[2],v[3],v[4],sep='\t')

train_no=input('请输入要买的车次')
info=dict_tickets.get(train_no,'车次不存在')
if info!='车次不存在':
    person=input('请输入乘车人，如果是多位，请用逗号分隔')
    s=info[0]+info[1]+info[2]+'开'
    print('您已购买了'+train_no+' '+s+', 请'+person+'尽快换取纸质票【铁路客服】')
else:
    print('选择的车次不存在')